Repository: ITMK/DataLitMT
Catalog: learning_resources/TM2TB/old_TM_en-us_de-de.tmx
Source language: en_us
Languages: de_de

source: total words within the Lilt Memory
de_de: Gesamtwortzahl innerhalb des Lilt Memories

source: Translation Memory Suggestions
de_de: Übersetzungsvorschläge aus Translation Memories

source: Adaptive models are trained in real-time whenever a segment is confirmed in the Project.
de_de: Adaptive Modelle werden in Echtzeit trainiert, sobald ein Segment im Projekt bestätigt wird.

source: Unlike most Language Service Providers (LSPs), Lilt does not use Machine Translation Post-Editing (MTPE), a process where Machine Translation (MT) is used to pre-translate texts for later human correction.
de_de: Im Gegensatz zu den meisten Sprachdienstleistern werden bei Lilt Dokumente nicht vollständig maschinell vorübersetzt und im Rahmen des Post-Editings korrigiert.

source: In some cases, adaptation will pick up on updated terminology in the very next segment. In other cases, it may take significantly longer.
de_de: Manchmal kann z. B. neue Terminologie von der Engine sofort in der nächsten Rohübersetzung abgerufen werden. In anderen Fällen dauert es deutlich länger.

source: Segment source text: The hares and the tortoise
de_de: Ausgangssegment: The hares and the tortoise

source: Knowledge Base
de_de: Wissensdatenbank

source: Lilt Memory languages
de_de: Sprachen des Lilt Memories

source: Select next word (Shift + Tab): Select the next suggested word from the suggestion area below the typing text.
de_de: Nächstes Wort auswählen (UMSCHALT + TAB): Das nächste Wort aus dem maschinell erstellten Übersetzungsvorschlag unterhalb des Eingabefelds wird ausgewählt.

source: At the far right of the typing area, there is a number display for how many characters are inside the typing area.
de_de: Rechts im Eingabefeld wird angezeigt, wieviele Zeichen der Zieltext aktuell enthält.

source: What is Interactive, Adaptive MT? – Lilt
de_de: Was ist interaktive, adaptive Maschinelle Übersetzung?

source: From inside the Memory view, you can access all the Memory Settings and contents of the selected Lilt Memory to Manage Your Termbases.
de_de: In der Memory-Ansicht können Sie auf alle Speichersteinstellungen und Inhalte zugreifen. So können Sie u. a. Ihre Terminologiedatenbanken verwalten.

source: Termbase (zero or many): A collection of source/target TB segments.
de_de: Termdatenbank (TB) (keine oder mehrere): Eine Sammlung von Terminologieeinträgen.

source: Each tab of the header is described in the sections below.
de_de: Die einzelnen Reiter der Kopfzeile werden in den folgenden Abschnitten erläutert.

source: Lilt Memories are sorted by their updated dates, with the most recently updated Lilt Memories appearing at the top of the list.
de_de: Lilt Memories werden nach ihrem Aktualisierungsdatum sortiert, wobei die zuletzt aktualisierten Lilt Memories ganz oben in der Liste aufgeführt werden.

source: Lilt's cloud-based CAT Editor provides linguists with all the functionality needed to enable skilled translators to do the best work of their careers quickly, accurately, and efficiently.
de_de: In dem cloud-basierten CAT Editor von Lilt stehen Übersetzer*innen alle wichtigen Funktionen zur Verfügung, mit denen sie in kürzester Zeit hochwertige Übersetzungen anfertigen können.

source: This article provides an overview for each of the CAT Editor components:
de_de: In diesem Artikel werden die einzelnen Funktionen und Komponenten des CAT-Editors erläutert:

source: If you are the only translator for a given document, you can utilize the option to add notes, make to-do lists, and create reminders.
de_de: Wenn Sie das Dokument alleine übersetzen, können Sie mit dieser Funktion Notizen hinzufügen und Aufgabenlisten oder Erinnerungen erstellen.

source: The Settings tab contains a variety of ways for you to customize the behavior of the Editor to suit your needs.
de_de: Im Tab Einstellungen finden Sie verschiedene Funktionen zur individuellen Anpassung des Editors.

source: TM suggestion order
de_de: Arten von TM-Matches

source: Submit a request
de_de: Anfrage senden

source: If there are multiple suggestions, they can be viewed in the Segment Context pane on the right side of the Editor.
de_de: Gibt es mehrere TM-Vorschläge für ein Segment, werden diese in der Randleiste rechts im Editor im Segmentkontextsuche angezeigt.

source: By default, this is enabled.
de_de: Diese Funktion ist standardmäßig aktiviert.

source: Lilt uses Machine Translation (MT) models to provide translation suggestions.
de_de: Bei Lilt kommen Engines zur maschinellen Übersetzung (MÜ) zum Einsatz, mit denen automatisch Übersetzungsvorschläge bereitgestellt werden.

source: While the Segment context pane sorts by reviewed/unreviewed status, TM matching ignores reviewed/unreviewed status.
de_de: Im Bereich Segmentkontextsuche werden TM-Einträge unter anderem nach ihrem Status lektoriert/nicht lektoriert sortiert, beim TM-Matching hingegen wird dieser Status nicht berücksichtigt.

source: There are three sidebar buttons on the right side of the Editor that are used to open and close the sidebar:
de_de: Auf der rechten Seite des Editors befinden sich drei Schaltflächen, mit denen die Randleiste geöffnet und geschlossen werden kann:

source: View tab
de_de: Registerkarte „Ansicht“

source: Adding and removing QA rules in a Lilt Memory
de_de: QA-Regel für ein Lilt Memory hinzufügen und entfernen
